package personnel;

import classes.CurrentState;

/**
 * Created by Albert on 27.09.2016.
 */
public class Helper {
    // надо понять алгоритм анализа события, по каким критериям он должен что-то выдавать
    // что он должен выдавать, сообщение с рекомендациями?
    // пример:
    // добраться куда-то (сколько займёт времени, на чём, сколько стоить будет)
    //
    public void analysisEvent(CurrentState cs){
        // входит текущее состояние, ивент
        // мы должны дать какие-то рекомендации
        // на чём ехать, например
    }
    public void sendMessage(){

    }
}
